import styles from './Text.module.scss';

export default function Text() {
  return (
    <>
      <p className={styles.Text}>ОБЩИЕ УСЛОВИЯ</p>
      <p className={styles.Text}>
        1. Настоящие Условия регулируют взаимоотношения Продавца/Правообладателя и Покупателя/Пользователя, а также
        определяют порядок розничной купли-продажи Товаров через Сайт/МП и правила использования Сайта/МП, и являются
        офертой Продавца/Правообладателя, адресованной Покупателям/Пользователям – физическим лицам. При совместном
        упоминании Продавец/Правообладатель и Покупатель/Пользователь также именуются – Стороны, а каждый по отдельности
        Сторона. Настоящие Условия регулируют в том числе:
      </p>
      <p className={styles.Text}>
        добровольный выбор Покупателем Товаров на Сайте/в МП; самостоятельное оформление Покупателем Заказа на Сайте/в
        МП; оплата Покупателем Заказа, оформленного на Сайте/в МП; выполнение и передача Заказа Покупателю в
        собственность в соответствии с настоящими Условиями. условия и порядок использования материалов, сервисов и
        функционала Сайта/МП, включая результаты интеллектуальной деятельности, элементы контента Сайта/МП;
        ответственность Сторон и другие особенности функционирования Сайта/МП, взаимоотношений Пользователей Сайта/МП с
        Продавцом/Правообладателем.
      </p>
      <p className={styles.Text}>
        2. К отношениям между Покупателем/Пользователем и Продавцом/Правообладателем применяются положения ГК РФ, Закона
        РФ «О защите прав потребителей» и иные нормативные правовые акты.
      </p>
      <p className={styles.Text}>
        3. Правообладатель безвозмездно на условиях простой (неисключительной) лицензии, предоставляет Пользователю
        непередаваемое право использования Сайта/МП по его прямому функциональному назначению в объеме и способами,
        указанными в настоящих Условиях. Данное право предоставляется Пользователю на срок, в течение которого, и в
        пределах территории, на которой Сайт/МП является доступным для Покупателя. Сайт/МП предоставляется Пользователю
        для личного некоммерческого использования. Пользователь не имеет право воспроизводить и распространять Сайт/МП в
        коммерческих целях.
      </p>
      <p className={styles.Text}>
        Отношения между Правообладателем и Пользователем в части, не урегулированной настоящими Условиями, регулируются
        положениями Части 4 ГК РФ, в том числе в части замены сторон по договору. Переход исключительного права на Сайт
        / МП к новому правообладателю не является основанием для изменения или расторжения настоящих Условий. Однако в
        случае такого отчуждения или иного предоставления прав на Сайт/МП, влекущего изменение Правообладателя,
        Правообладатель проинформирует о нем Пользователя в порядке, установленном в п. 4. далее.
      </p>
      <p className={styles.Text}>
        4. Продавец/Правообладатель сохраняет за собой право в одностороннем порядке вносить изменения в настоящие
        Условия с предварительной их публикацией на Сайте/в МП. Адрес действующей редакции Условий в сети Интернет:
        https://www.roga&kopita.ru/ Новая редакция Условий вступает в силу в силу с даты ее публикации на Сайте/в МП.
        Продолжение использования Сайта/МП или оформление Заказа означает согласие Покупателя с положениями новой
        редакции Условий.
      </p>
      <p className={styles.Text}>
        5. Использование Сайта/МП для просмотра и выбора Товара, а также для оформления Заказа является для
        Пользователя/Покупателя безвозмездным. Информация, размещенная на Сайте/в МП о Товарах, акциях, новостях
        Продавца/Правообладателя, адресах магазинов и прочее, является публичной и общедоступной, если иное не
        установлено настоящими Условиями.
      </p>
    </>
  );
}
